<?php 
/*
	数字函数
*/
//  1、   abs() 绝对值函数   eg：
echo $abs = abs(-4.2);
echo '<hr>';//-------4.2--------

//  2、  ceil() 进一法取整  
echo ceil(9.00000000001);//只要有小数点后面有大于0的数字就进1
echo '<hr>';//------10-----------

//   3、  floor()   舍去法取整 
echo floor(9.99999999);//有小数点就舍去
echo '<hr>';//--------9------------

//  4、   fmod()   浮点数取余
$x = 57;
$y = 1.3;
$r = fmod($x,$y);
//返回被除数（x）除以除数（y）所得的浮点数余数。余数（r）的定义是：x = i * y + r，其中 i 是整数。如果 y是非零值，则 r 和 x 的符号相同并且其数量值小于 y 
echo $r;
echo '<hr>';//--------1.1------------

// 5、    pow()  返回数的n次方
echo pow(-1,20),'<br>';//-1的20次方，结果
echo pow(2,10);//2的10次方是1024
echo '<hr>';//---------1---1024--------

//  6、   round()  浮点数四舍五入
echo round(1.95583,2),'<br>';//1.96
echo round(2.9525,3);//保留3位小数，四舍五入法
echo '<hr>';//--------1.96-----2.953-------

//  7、   sqrt()    求平方根
echo sqrt(9);//9的平方根是3；
echo '<hr>';//---------3-----------

//  8、   max()   求最大值  
echo max(1,2,3,5,7,8,11),'<br>';
echo max(22,44,111,657);
echo '<hr>';//------11------657--------

//  9、   min()    求最小值
echo min(2,3,7,99),'<br>';
echo min(array(2,4,7));
echo '<hr>';//------2---------2-----

//  10、   mt_rand()  更好的随机数
echo mt_rand(1,77);
echo mt_rand(1,77);
echo '<hr>';//--------------------

//  11、   rand()    随机数
echo rand(1,77);
echo rand(1,77);
echo '<hr>';//--------------------

//  12、   pi()  获取圆周率值
echo round(pi(),20);//最多获取小数点后13位的PI
echo '<hr>';//--------3.1415926535898------------

//  13、   intval()   获取变量的整数值
echo intval(4.2),'&nbsp;';
echo intval('49');//自动把字符串变为整型
echo '<hr>';//------4-------49-------


